cool/tutorials/incompressible/icoDyMFoam/turboPassageRotating/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
 ( 10.           0.           0.        )
 ( 10.           0.          10.        )
 ( 18.           0.           0.        )
 ( 18.           0.          10.        )
 ( 20.           0.           0.        )
 ( 20.           0.          10.        )
 ( 19.69615506   3.47296355   0.        )
 ( 19.69615506   3.47296355  10.        )
 ( 21.66577057   3.82025991   0.        )
 ( 21.66577057   3.82025991  10.        )
 ( 29.54423259   5.20944533   0.        )
 ( 29.54423259   5.20944533  10.        )
 (  8.66025404   5.           0.        )
 (  8.66025404   5.          10.        )
 ( 15.58845727   9.           0.        )
 ( 15.58845727   9.          10.        )
 ( 17.32050808  10.           0.        )
 ( 17.32050808  10.          10.        )
 ( 15.32088886  12.85575219   0.        )
 ( 15.32088886  12.85575219  10.        )
 ( 16.85297775  14.14132741   0.        )
 ( 16.85297775  14.14132741  10.        )
 ( 22.98133329  19.28362829   0.        )
 ( 22.98133329  19.28362829  10.        )
);

blocks
(
    hex (0 12 13 1 2 14 15 3  )  (20 10 20) simpleGrading (1 1 1)
    hex (2 14 15 3 4 16 17 5  )  (20 10 5)  simpleGrading (1 1 1)
    hex (6 18 19 7 8 20 21 9  )  (20 10 5)  simpleGrading (1 1 1)
    hex (8 20 21 9 10 22 23 11 ) (20 10 20) simpleGrading (1 1 1)
);

edges
(
arc  0 12 ( 9.65925826  2.58819045  0.        )
arc  1 13 (  9.65925826   2.58819045  10.        )
arc  2 14 ( 17.38666487   4.65874281   0.        )
arc  3 15 ( 17.38666487   4.65874281  10.        )
arc  4 16 ( 19.31851653   5.1763809    0.        )
arc  5 17 ( 19.31851653   5.1763809   10.        )
arc  6 18 ( 19.31851653   5.1763809    0.        )
arc  7 19 ( 19.31851653   5.1763809   10.        )
arc  8 20 ( 21.25036818   5.69401899   0.        )
arc  9 21 ( 21.25036818   5.69401899  10.        )
arc  10 22 ( 28.97777479   7.76457135   0.        )
arc  11 23 ( 28.97777479   7.76457135  10.        )
);

patches
(
    patch inlet
    (
        (0 12 13 1)
    )
    patch outlet
    (
        (10 22 23 11)
    )
    wall fixedWalls
    (
        (6 18 20 8)
        (7 19 21 9)
        (8 20 22 10)
        (9 21 23 11)
        (20 22 23 21)
        (8 10 11 9)
    )
    patch movingwalls
    (
        (2 14 16 4)
        (3 15 17 5)
        (0 12 14 2)
        (1 13 15 3)
        (12 14 15 13)
        (0 2 3 1)
    )
    cyclicGgi rotor_cyclic_upper
    (
        (14 16 17 15)
    )
    cyclicGgi rotor_cyclic_lower
    (
        (2 4 5 3)
    )
    cyclic stator_cyclics
    (
        (6 8 9 7)
        (18 20 21 19)
    )
    overlapGgi interface1
    (
        (4 5 17 16)
    )
    overlapGgi interface2
    (
        (6 7 19 18)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //

